<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<title>eXtreme Programming Brasil - CHAMADA DE TRABALHOS</title>
<link type="text/css" rel="stylesheet" href="cfp.css">
</head>
<body>
<div class="all">
<hr>Inclua cabe&ccedil;alho aqui - esta p&aacute;gina foi gerada a partir de XML. Fa&ccedil;a as altera&ccedil;&otilde;es
                no documento cfp_to_html.xsl ou xpbrasil_cfp.xml. Altere o estilo em cfp.css.<hr>
<h1>CHAMADA DE TRABALHOS</h1>
<h2>eXtreme Programming Brasil</h2>
<ul>
<li>
<a href="#formas">Formas de apresenta&ccedil;&atilde;o</a>
</li>
<li>
<a href="#revista">Revista eXtreme Programming Brasil</a>
</li>
<li>
<a href="#beneficios">Benef&iacute;cios aos palestrantes</a>
</li>
<li>
<a href="#datas">Datas importantes</a>
</li>
<li>
<a href="#procedimento">Procedimento para submiss&atilde;o de trabalhos</a>
</li>
</ul>
<div id="intro">
<a name="intro"></a>
<h3></h3>
    
<p>O congresso <b>eXtreme Programming Brasil</b> tem como objetivo
    reunir a comunidade brasileira de usu&aacute;rios e interessados em
    metodologias &aacute;geis de desenvolvimento de software para relatar 
    suas experi&ecirc;ncias, propor solu&ccedil;&otilde;es, apresentar aplica&ccedil;&otilde;es pr&aacute;ticas e
    discutir as implica&ccedil;&otilde;es do uso da metodologia <a href="http://xp">eXtreme Programming</a> e
    outras metodologias &aacute;geis no processo de desenvolvimento de software.</p>
    
    
<p>Convidamos autores, profissionais, academicos e especialistas que
    utilizam a metodologia XP no seu dia-a-dia, em suas pesquisas e em
    ambientes de produ&ccedil;&atilde;o para contribuir com <b>palestras</b>, <b>artigos</b> e <b>tutoriais</b> voltados
    para o p&uacute;blico t&eacute;cnico (desenvolvedores) e gerencial (gerentes e
    clientes de software). </p>
    
    
<p>Os trabalhos submetidos devem estar relacionados &agrave; metologia 
    XP ou outras metodologias &aacute;geis. Os assuntos de interesse incluem
    mas n&atilde;o se limitam a:</p>
    
    
<ul>
        
<li>Estudos de caso e relatos de experi&ecirc;ncias com XP e metodologias &aacute;geis</li>
        
<li>Discuss&atilde;o comparativa de outros processos e metodologias em rela&ccedil;&atilde;o ao XP</li>
        
<li>Dificuldades na implanta&ccedil;&atilde;o e gerenciamento de XP</li>
        
<li>T&eacute;cnicas e ferramentas para implantar pr&aacute;ticas do XP</li>
        
<li>Introdu&ccedil;&atilde;o a pr&aacute;ticas espec&iacute;ficas do XP (as 12 pr&aacute;ticas)</li>
        
<li>Pair programming: experi&ecirc;ncias e t&eacute;cnicas</li>
        
<li>Testes de unidade e de aceita&ccedil;&atilde;o: solu&ccedil;&otilde;es pr&aacute;ticas, experiencias</li>
        
<li>Refactoring (refinamento constante e redesign durante o processo de desenvolvimento)</li>
        
<li>Integra&ccedil;&atilde;o cont&iacute;nua</li>
        
<li>Certifica&ccedil;&atilde;o de processos XP (CMM, ISO 9001, etc.)</li>
        
<li>Planejamento e estrat&eacute;gias de viabiliza&ccedil;&atilde;o de projetos XP</li>
        
<li>Experiencias e/ou resultados da introdu&ccedil;&atilde;o de XP e outras metodologias em cursos universit&aacute;rios.</li>
    
</ul>
    
    
<p>Al&eacute;m dos palestrantes selecionados, o evento tamb&eacute;m contar&aacute; com palestrantes internacionais convidados.
    At&eacute; o momento est&aacute; confirmada a presen&ccedil;a de <a href="http://kent">Kent Beck</a> - criador do eXtreme Programming e <a href="http://scott">Scott Ambler</a>.
    </p>
    
    
</div>
<div id="formas">
<a name="formas"></a>
<h3>Formas de apresenta&ccedil;&atilde;o</h3>
    
<p>Os trabalhos submetidos podem ser apresentados em dois formatos: <b>palestra</b> ou <b>tutorial</b>.
    As palestras t&ecirc;m dura&ccedil;&atilde;o de uma hora. Os tutoriais, com dura&ccedil;&atilde;o de 3 ou de 6 horas, exploram
    temas que requerem um tempo maior para exposi&ccedil;&atilde;o. .</p>
    
</div>
<div id="revista">
<a name="revista"></a>
<h3>Revista eXtreme Programming Brasil</h3>
    
<p>O <b>eXtreme Programming Brasil</b> tamb&eacute;m aceitar&aacute; a submiss&atilde;o de <b>artigos</b> sobre os temas propostos.
    Os artigos devem ter entre 2 e 6 p&aacute;ginas (inclu&iacute;ndo as ilustra&ccedil;&otilde;es) em formato A4 e fonte
    Times Roman 10 pontos. O formato para sumbiss&atilde;o de artigos ser&aacute; divulgado em breve. O evento
    produzir&aacute; uma revista contendo entre 10 e 15 artigos selecionados.</p>
    
<p>Os artigos s&atilde;o independentes das palestras e tutoriais mas nada impede que um palestrante
    submeta um artigo e uma palestra ou tutorial. Isto inclusive &eacute; estimulado. Palestras e tutoriais
    t&eacute;cnicos submetidos com artigos ter&atilde;o maiores chances de aprova&ccedil;&atilde;o.</p>
    
<p>A revista conter&aacute;, al&eacute;m dos artigos selecionados, artigos de autores convidados e
    espa&ccedil;os destinados &agrave; publicidade.</p>
    
</div>
<div id="beneficios">
<a name="beneficios"></a>
<h3>Benef&iacute;cios aos palestrantes</h3>
    
<p>Palestrantes do <b>eXtreme Programming Brasil</b> ter&atilde;o acesso livre em qualquer palestra do
    evento e poder&atilde;o assistir quaisquer tutoriais que n&atilde;o estiverem com sua capacidade
    esgotada.</p>
    
</div>
<div id="datas">
<a name="datas"></a>
<h3>Datas importantes</h3>
    
<ul>
        
<li>Data limite para envio de propostas
               : 30 de setembro de 2002</li>
        
<li>Pr&eacute;-sele&ccedil;&atilde;o
               : 10 de outubro</li>
        
<li>Vota&ccedil;&atilde;o p&uacute;blica 
               : 10 a 20 de outubro</li>
        
<li>Data limite para submiss&atilde;o de artigos
               : 20 de outubro</li>
        
<li>Notifica&ccedil;&atilde;o de aceita&ccedil;&atilde;o
               : 30 de outubro</li>
        
<li>Data limite para envio do material para a coordena&ccedil;&atilde;o t&eacute;cnica
               : 20 de outubro</li>
        
<li>Realiza&ccedil;&atilde;o do evento
               : 4 de dezembro</li>
    
</ul>
    
</div>
<div id="procedimento">
<a name="procedimento"></a>
<h3>Procedimento para submiss&atilde;o de trabalhos</h3>
    
<p>Em breve ser&aacute; disponibilizado um formul&aacute;rio para facilitar a submiss&atilde;o de trabalhos. Caso voc&ecirc; j&aacute; tenha um trabalho a submeter, 
    voce j&aacute; pode enviar a proposta. Ela deve estar em formato texto (anexo ou diretamente no corpo do e-mail) e conter T&iacute;tulo, 
    resumo de 100 palavras (m&aacute;ximo), assuntos que ser&atilde;o abordados (lista de t&oacute;picos - at&eacute; 100 palavras), p&uacute;blico-alvo (gerencial 
    ou t&eacute;cnico), formato (tutorial ou palestra e/ou artigo), seu nome, empresa/institui&ccedil;&atilde;o e curriculum vitae resumido 
    (at&eacute; 300 palavras) para <a href="mailto:email">email@dominio.com.br</a>. </p>
    
</div>
<hr>Inclua rodap&eacute; aqui<hr>
</div>
</body>
</html>
